// 公式1-5
// \begin{ align }
//     A(i, j) =
//     \begin{ cases }
//         2 ^ j                    &    i = 1 和 j \geq 1    \\
//         A(i - 1, 2)              &    i \geq 2 和 j = 1     \\
//         A(i - 1, A(i, j - 1))    &    i, j \geq 2
//     \end{ cases }
// \end{ align }


// 题22:
// [阿克曼函数(Ackermann's Function)] 公式(1-5)定义的是阿克曼函数.
// 其中, i 和 j 是大于等于1的整数.
//
// 题22-1:
// 使用公式（1-5）手算 A(1,2), A(2,1), A(2,2)
//
// A(1, 2):
// A(1, 2) = 2^2
//         = 4
//
//
// A(2, 1):
// A(2, 1) = (2 - 1, 2)
//         = 1, 2
// A(1, 2) = 2 ^ 2
//         = 4
//
//
// A(2, 2):
// A(2, 2) = (2 - 1, A(2, 2 - 1))
//         = (1, A(2, 1))
//         = (1, A(2-1, 2))
//         = (1, A(1, 2))
//         = (1, 2 ^ 2)
//         = (1, 4)
//         = 2 ^ 4
//         = 16
